%% 参数
%变量定义
Pv=0; %待选址光伏位置数量
Wd=2; %待选址风机位置数量
St=3; %待选址储能位置数量
D=Pv+Wd+St; %总选址定容数

N=1; %粒子个数

% 风机储能基本参数
ad_wd=linspace(2,33,32); %风机待选节点，可更改节点数量和编号，程序会自动变更
ad_st=linspace(2,33,32); %储能待选节点，可更改节点数量和编号，程序会自动变更
num_wd=linspace(1,5,5); %风机待选数量
num_st=linspace(1,40,40); %储能待选数量
s_wd=1500; %单台风机容量1500kw
s_st=240; %单台储能额定容量240kw

% 电价（元/kwh）
% 购电
pbuy_top=0.65; %峰时电价（10:00~11:00、19:00~21:00）
pbuy_down=0.32; %谷时电价（0:00~6:00、23:00~24:00）
pbuy_ave=0.49; %平时电价 （else）
% 售电
psell_top=0.65; %峰时电价（10:00~11:00、19:00~21:00）
psell_down=0.32; %谷时电价（0:00~6:00、23:00~24:00）
psell_ave=0.49; %平时电价 （else）
cq_wd=2; %弃风惩罚成本
cdan=3; %失电惩罚成本

% 投资运行成本参数
r=0.08; %贴现率

% 风机
year1=20; %风机使用年限
cbuy_wd=415; %单台风机购买费用（万元）
cins_wd=6.8; %单台风机安装费用
crem_wd=17.5; %单台风机剩余价值
crun_wd=0.0296; %风机运维费用（元/kwh）

% 储能
year2=20; %储能使用年限
cbuy_st=85; %单台储能购买费用
cins_st=2.1; %单台储能安装费用
crem_st=3.6;  %单台储能剩余价值
crun_st=0.05; %储能运维费用
eta=0.9; %储能充放电效率
cta=0.003; %储能自放电系数
socmin=0.1; %储能soc
socmax=0.9;

% 并网逆变器参数
year3=20; %使用年限
econ=0.95; %变换效率
cbuy_con=0.25; %投资费用（万元/kwh）
crun_con=0.01; %运维费用

%负荷比例（24h）
pl=[0.729259757738896,0.676419919246299,0.623580080753701,0.579838492597577,0.547294751009421,0.564091520861373,0.693566621803499,0.766002691790040,0.844037685060565,0.954966352624495,1.01655450874832,1.08339165545088,1.11593539703903,1.07534320323015,1.04979811574697,1.02075370121131,1.10193808882907,1.17402422611036,1.23386271870794,1.26675639300135,1.30000000000000,1.14637954239569,1.01865410497981,0.807994616419919];
mpc=loadcase('case33bw'); %配电网选用33节点数据
K=4; %场景数
T=24; %时间段
